# Business Analysis for Northwinds Shipping Co.

This is a mock business analysis for Northwinds Shipping Co. The project highlights knowledge of sqlite in Python and knowledge of hypothesis testing to uncover statistically significant differences in business operations.

### Business Questions to answer
- Does discount amount have a statistically significant effect on the quantity of a product in an order? If so, at what level(s) of discount?

In [1]:
import pandas as pd
import numpy as np
from numpy import std, mean, sqrt
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import sqlite3
from sqlite3 import Error
import itertools

import statsmodels.api as sm
from statsmodels.formula.api import ols
import scipy.stats as stats
from statsmodels.stats.power import TTestIndPower, TTestPower

#File with functions written for the project
from ProjectFunctions import get_sample, get_sample_mean, cohens_d
from datetime import datetime

import warnings
warnings.filterwarnings("ignore")

In [2]:
conn = sqlite3.Connection('Northwind_small.sqlite')
cur = conn.cursor()

In [3]:
table_names = pd.read_sql('SELECT name FROM sqlite_master WHERE type="table"', conn)
table_names = table_names.drop([5,8,9], axis=0)

tn_list = table_names.name
select_template = 'SELECT * FROM {name}'
fd = {}
for tn in tn_list:
    query = select_template.format(name = tn)
    fd[tn] = pd.read_sql(query, conn)
    
fd["Order"] = pd.read_sql('''SELECT * FROM "Order"''', conn)

In [4]:
#Making a df for each of the tables generated from the SQL tables

Ordr = pd.DataFrame(fd["Order"])
Employee = pd.DataFrame(fd["Employee"])
Category = pd.DataFrame(fd["Category"])
Customer = pd.DataFrame(fd["Customer"])
Shipper = pd.DataFrame(fd["Shipper"])
Supplier = pd.DataFrame(fd["Supplier"])
Product = pd.DataFrame(fd["Product"])
OrderDetail = pd.DataFrame(fd["OrderDetail"])
Region = pd.DataFrame(fd["Region"])
Territory = pd.DataFrame(fd["Territory"])
EmployeeTerritory = pd.DataFrame(fd["EmployeeTerritory"])

### EDA

![title](Northwind_ERD_updated.png)

In [5]:
#While the above was provided by the company, this code provides heads of all tables
tables = [Ordr, Employee, Category, Customer, Shipper, Supplier, Product, 
          OrderDetail, Region, Territory, EmployeeTerritory]
for i in tables:
    print(i.head())

      Id CustomerId  EmployeeId   OrderDate RequiredDate ShippedDate  ShipVia  \
0  10248      VINET           5  2012-07-04   2012-08-01  2012-07-16        3
1  10249      TOMSP           6  2012-07-05   2012-08-16  2012-07-10        1
2  10250      HANAR           4  2012-07-08   2012-08-05  2012-07-12        2
3  10251      VICTE           3  2012-07-08   2012-08-05  2012-07-15        1
4  10252      SUPRD           4  2012-07-09   2012-08-06  2012-07-11        2

   Freight                   ShipName           ShipAddress        ShipCity  \
0    32.38  Vins et alcools Chevalier    59 rue de l'Abbaye           Reims
1    11.61         Toms Spezialitäten         Luisenstr. 48         Münster
2    65.83              Hanari Carnes       Rua do Paço, 67  Rio de Janeiro
3    41.34       Victuailles en stock    2, rue du Commerce            Lyon
4    51.30           Suprêmes délices  Boulevard Tirou, 255       Charleroi

       ShipRegion ShipPostalCode ShipCountry
0  Western Europe          51100      France
1  Western Europe          44087     Germany
2   South America      05454-876      Brazil
3  Western Europe          69004      France
4  Western Europe         B-6000     Belgium
   Id   LastName FirstName                  Title TitleOfCourtesy   BirthDate  \
0   1    Davolio     Nancy   Sales Representative             Ms.  1980-12-08
1   2     Fuller    Andrew  Vice President, Sales             Dr.  1984-02-19
2   3  Leverling     Janet   Sales Representative             Ms.  1995-08-30
3   4    Peacock  Margaret   Sales Representative            Mrs.  1969-09-19
4   5   Buchanan    Steven          Sales Manager             Mr.  1987-03-04

     HireDate                     Address      City         Region PostalCode  \
0  2024-05-01  507 - 20th Ave. E. Apt. 2A   Seattle  North America      98122
1  2024-08-14          908 W. Capital Way    Tacoma  North America      98401
2  2024-04-01          722 Moss Bay Blvd.  Kirkland  North America      98033
3  2025-05-03        4110 Old Redmond Rd.   Redmond  North America      98052
4  2025-10-17             14 Garrett Hill    London  British Isles    SW1 8JR

  Country       HomePhone Extension Photo  \
0     USA  (206) 555-9857      5467  None
1     USA  (206) 555-9482      3457  None
2     USA  (206) 555-3412      3355  None
3     USA  (206) 555-8122      5176  None
4      UK   (71) 555-4848      3453  None

                                               Notes  ReportsTo  \
0  Education includes a BA in psychology from Col...        2.0
1  Andrew received his BTS commercial in 1974 and...        NaN
2  Janet has a BS degree in chemistry from Boston...        2.0
3  Margaret holds a BA in English literature from...        2.0
4  Steven Buchanan graduated from St. Andrews Uni...        2.0

                                PhotoPath
0    http://accweb/emmployees/davolio.bmp
1     http://accweb/emmployees/fuller.bmp
2  http://accweb/emmployees/leverling.bmp
3    http://accweb/emmployees/peacock.bmp
4   http://accweb/emmployees/buchanan.bmp
   Id    CategoryName                                        Description
0   1       Beverages        Soft drinks, coffees, teas, beers, and ales
1   2      Condiments  Sweet and savory sauces, relishes, spreads, an...
2   3     Confections                Desserts, candies, and sweet breads
3   4  Dairy Products                                            Cheeses
4   5  Grains/Cereals                Breads, crackers, pasta, and cereal
      Id                         CompanyName         ContactName  \
0  ALFKI                 Alfreds Futterkiste        Maria Anders
1  ANATR  Ana Trujillo Emparedados y helados        Ana Trujillo
2  ANTON             Antonio Moreno Taquería      Antonio Moreno
3  AROUT                     Around the Horn        Thomas Hardy
4  BERGS                  Berglunds snabbköp  Christina Berglund

           ContactTitle                        Address         City  \
0  Sales Representative                  Obere Str. 57       Berlin
1                 Owner  Avda. de la Constitución 2222  México D.F.
2                 Owner                Mataderos  2312  México D.F.
3  Sales Representative                120 Hanover Sq.       London
4   Order Administrator                Berguvsvägen  8        Luleå

            Region PostalCode  Country           Phone             Fax
0   Western Europe      12209  Germany     030-0074321     030-0076545
1  Central America      05021   Mexico    (5) 555-4729    (5) 555-3745
2  Central America      05023   Mexico    (5) 555-3932            None
3    British Isles    WA1 1DP       UK  (171) 555-7788  (171) 555-6750
4  Northern Europe   S-958 22   Sweden   0921-12 34 65   0921-12 34 67
   Id       CompanyName           Phone
0   1    Speedy Express  (503) 555-9831
1   2    United Package  (503) 555-3199
2   3  Federal Shipping  (503) 555-9931
   Id                         CompanyName                 ContactName  \
0   1                      Exotic Liquids            Charlotte Cooper
1   2          New Orleans Cajun Delights               Shelley Burke
2   3           Grandma Kelly's Homestead               Regina Murphy
3   4                       Tokyo Traders                Yoshi Nagase
4   5  Cooperativa de Quesos 'Las Cabras'  Antonio del Valle Saavedra

           ContactTitle                    Address         City  \
0    Purchasing Manager             49 Gilbert St.       London
1   Order Administrator             P.O. Box 78934  New Orleans
2  Sales Representative             707 Oxford Rd.    Ann Arbor
3     Marketing Manager  9-8 Sekimai Musashino-shi        Tokyo
4  Export Administrator          Calle del Rosal 4       Oviedo

            Region PostalCode Country           Phone             Fax  \
0    British Isles    EC1 4SD      UK  (171) 555-2222            None
1    North America      70117     USA  (100) 555-4822            None
2    North America      48104     USA  (313) 555-5735  (313) 555-3349
3     Eastern Asia        100   Japan  (03) 3555-5011            None
4  Southern Europe      33007   Spain  (98) 598 76 54            None

      HomePage
0         None
1  #CAJUN.HTM#
2         None
3         None
4         None
   Id                   ProductName  SupplierId  CategoryId  \
0   1                          Chai           1           1
1   2                         Chang           1           1
2   3                 Aniseed Syrup           1           2
3   4  Chef Anton's Cajun Seasoning           2           2
4   5        Chef Anton's Gumbo Mix           2           2

       QuantityPerUnit  UnitPrice  UnitsInStock  UnitsOnOrder  ReorderLevel  \
0   10 boxes x 20 bags      18.00            39             0            10
1   24 - 12 oz bottles      19.00            17            40            25
2  12 - 550 ml bottles      10.00            13            70            25
3       48 - 6 oz jars      22.00            53             0             0
4             36 boxes      21.35             0             0             0

   Discontinued
0             0
1             0
2             0
3             0
4             1
         Id  OrderId  ProductId  UnitPrice  Quantity  Discount
0  10248/11    10248         11       14.0        12       0.0
1  10248/42    10248         42        9.8        10       0.0
2  10248/72    10248         72       34.8         5       0.0
3  10249/14    10249         14       18.6         9       0.0
4  10249/51    10249         51       42.4        40       0.0
   Id RegionDescription
0   1           Eastern
1   2           Western
2   3          Northern
3   4          Southern
      Id TerritoryDescription  RegionId
0  01581             Westboro         1
1  01730              Bedford         1
2  01833            Georgetow         1
3  02116               Boston         1
4  02139            Cambridge         1
        Id  EmployeeId TerritoryId
0  1/06897           1       06897
1  1/19713           1       19713
2  2/01581           2       01581
3  2/01730           2       01730
4  2/01833           2       01833

In [6]:
OrderDetail.head()

         Id  OrderId  ProductId  UnitPrice  Quantity  Discount
0  10248/11    10248         11       14.0        12       0.0
1  10248/42    10248         42        9.8        10       0.0
2  10248/72    10248         72       34.8         5       0.0
3  10249/14    10249         14       18.6         9       0.0
4  10249/51    10249         51       42.4        40       0.0

In [7]:
OrderDetail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2155 entries, 0 to 2154
Data columns (total 6 columns):
Id           2155 non-null object
OrderId      2155 non-null int64
ProductId    2155 non-null int64
UnitPrice    2155 non-null float64
Quantity     2155 non-null int64
Discount     2155 non-null float64
dtypes: float64(2), int64(3), object(1)
memory usage: 101.1+ KB

In [8]:
for i in OrderDetail.columns:
    print(i, len(set(OrderDetail[i])))

Id 2155
OrderId 830
ProductId 77
UnitPrice 116
Quantity 55
Discount 11

In [9]:
OrderDetail['Discount'].value_counts()

0.00    1317
0.05     185
0.10     173
0.20     161
0.15     157
0.25     154
0.03       3
0.02       2
0.01       1
0.04       1
0.06       1
Name: Discount, dtype: int64

In [10]:
OrderDetail = OrderDetail[(OrderDetail['Discount'] != 0.06) & (OrderDetail['Discount'] != 0.03) & (OrderDetail['Discount'] != 0.02) & (OrderDetail['Discount'] != 0.01) & (OrderDetail['Discount'] != 0.04)]
OrderDetail.Discount.value_counts()

0.00    1317
0.05     185
0.10     173
0.20     161
0.15     157
0.25     154
Name: Discount, dtype: int64

In [20]:
conn = sqlite3.Connection('Northwind_small.sqlite')
cur = conn.cursor()

od_query = pd.read_sql('''SELECT a.OrderId, a.ProductId, a.UnitPrice, a.Quantity, a.Discount, c.CategoryName 
                          FROM OrderDetail a LEFT JOIN Product b ON a.ProductId = b.ID LEFT JOIN Category c ON b.CategoryId = c.ID''', conn)

pd.DataFrame(od_query)

      OrderId  ProductId  UnitPrice  Quantity  Discount    CategoryName
0       10248         11      14.00        12      0.00  Dairy Products
1       10248         42       9.80        10      0.00  Grains/Cereals
2       10248         72      34.80         5      0.00  Dairy Products
3       10249         14      18.60         9      0.00         Produce
4       10249         51      42.40        40      0.00         Produce
...       ...        ...        ...       ...       ...             ...
2150    11077         64      33.25         2      0.03  Grains/Cereals
2151    11077         66      17.00         1      0.00      Condiments
2152    11077         73      15.00         2      0.01         Seafood
2153    11077         75       7.75         4      0.00       Beverages
2154    11077         77      13.00         2      0.00      Condiments

[2155 rows x 6 columns]